app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC LIMIT 6 OFFSET 0
---
  def index
    ord = 'created_at DESC'
    cond = ['validated = ?', true]

    cond[0] += ' and date_end_wish > ?'
    cond << Date.today

    case params[:type]
    when 'entreprise'
      cond[0] += ' and capital_stock_type = ?'
      cond << true
    when 'projets'
      cond[0] += ' and personalized_reward = ?'
      cond << true
    when 'finished'
      cond = ['validated = ? and date_end_wish < ? ', true, Date.today]
    end

    case params[:sort]
    when 'finishing'
      ord = 'date_end_wish ASC'
    when 'finished'
      cond = ['validated = ? and date_end_wish < ? ', true, Date.today]
    when 'recent'
      ord = 'date_end_wish DESC'
    end


    @projects = Project.paginate :page => params[:page], :per_page => 6, :order => ord, :conditions => cond